LiteOS/LiteOS/GD32F207_Library/FWLib/src/gd32f20x_rcc.c
/**
  ******************************************************************************
  * @file    gd32f20x_rcc.c
  * @author  MCU SD
  * @version V1.0.0
  * @date    15-Jul-2015
  * @brief   RCC functions of the firmware library.
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "gd32f20x_rcc.h"

/** @addtogroup GD32F20x_Firmware
  * @{
  */

/** @defgroup RCC 
  * @brief RCC driver modules
  * @{
  */ 

/** @defgroup RCC_Private_Defines
  * @{
  */


/* RCC GCCR_HSIEN mask */
#define  GCCR_HSIEN_SET                                 ((uint32_t)0x00000001)

/* RCC GCFGR_Reset mask */
#define  GCFGR_RESET                                    ((uint32_t)0xE0FF0000)

/* RCC GCCR_HSEEN_CKMEN_PLLEN masks */
#define  GCCR_HSEEN_CKMEN_PLLEN_RESET                   ((uint32_t)0xFEF6FFFF)

/* RCC GCCR_HSEBPS mask */
#define  GCCR_HSEBPS_RESET                              ((uint32_t)0xFFFBFFFF)

/* RCC GCFGR_PLLSEL_PLLPREDV_PLLMF masks */
#define  GCFGR_PLLSEL_PLLPREDV_PLLMF_OTGFSPS_RESET      ((uint32_t)0xDF00FFFF)

/* RCC GCCR_PLL2EN_PLL3EN masks */
#define  GCCR_PLL2EN_PLL3EN_RESET                       ((uint32_t)0xEBFFFFFF)

/* RCC GCFGR2 reset */
#define  GCFGR2_RESET                                   ((uint32_t)0x00000000)

/* RCC GCIR_INT ans FLAG masks */
#define  GCIR_INT_FLAG_RESET                           ((uint32_t)0x00FF0000)

#define  GCCR_HSEEN_HSEBPS_RESET                        ((uint32_t)0xFFFAFFFF)

/* RCC GCCR_HSIADJ masks */
#define  GCCR_HSIADJ_OFFSET                             ((uint32_t)0x00000003)


#define  RCC_GCFGR_PLLMF_3_0                            ((uint32_t)0x003C0000) /*!< PLLMF[3:0] Bits */

/* RCC HSI clock divided by 2 masks */
#define  HSI_CLOCK_DIVIDED_2                            ((uint32_t)0x00000001)

/* RCC HSE clock divided by 2 masks */
#define  HSE_CLOCK_DIVIDED_2                            ((uint32_t)0x00000001)


static __I uint8_t AHBPrescTable[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};
static __I uint8_t APBPrescTable[8] = {0, 0, 0, 0, 1, 2, 3, 4};


/* RCC Flag Mask */
#define FLAG_MASK                                       ((uint8_t)0x1F)

/* RCC GCFGR3 reset */
#define  GCFGR3_RESET                                   ((uint32_t)0x00000000)

/* RCC GPLLTIR_INT ans FLAG masks */
#define  GPLLTIR_INT_FLAG_RESET                         ((uint32_t)0x00400000)

/* RCC PLLTCFGR reset */
#define  PLLTCFGR_RESET                                 ((uint32_t)0x20003010)


/**
  * @}
  */

/** @defgroup RCC_Private_Functions
  * @{
  */

/**
  * @brief  Reset the RCC clock configuration.
  * @param  None
  * @retval None
  */
void RCC_DeInit(void)
{
    /* Set RCC GCCR_HSIEN mask */
    RCC->GCCR |= GCCR_HSIEN_SET;
    
    /* Reset SCS[1:0], AHBPS[3:0], APB1PS[2:0],APB2PS[2:0], ADCPS[2:0],CKOTUSEL[2:0] bits */
    RCC->GCFGR &= GCFGR_RESET;
  
    /* Reset HSEEN, CKMEN and PLLEN bits */
    RCC->GCCR &= GCCR_HSEEN_CKMEN_PLLEN_RESET;

    /* Reset HSEBPS bit */
    RCC->GCCR &= GCCR_HSEBPS_RESET;

    /* Reset PLLSEL, PLLPREDV and PLLMF[4:0] USBPS/OTGFSPS bits */
    RCC->GCFGR &= GCFGR_PLLSEL_PLLPREDV_PLLMF_OTGFSPS_RESET;
    
    /* Reset PLL2EN and PLL3EN bits */
    RCC->GCCR &= GCCR_PLL2EN_PLL3EN_RESET;

    /* Reset GCFGR2 register */
    RCC->GCFGR2 =GCFGR2_RESET ;

    /* Disable all interrupts and clear flag bits */
    RCC->GCIR = GCIR_INT_FLAG_RESET;

    /* Reset GCFGR3 register */
    RCC->GCFGR3 =GCFGR3_RESET ;

    /* Disable all interrupts and clear flag bits */
    RCC->GPLLTIR = GPLLTIR_INT_FLAG_RESET;

    /* Reset PLLTCFGR register */
    RCC->PLLTCFGR = PLLTCFGR_RESET;
}

/**
  * @brief  Configure the External High Speed oscillator (HSE).
  * @param  RCC_HSE: specify the new state of HSE.
  *   This parameter can be one of the following values:
  *   @arg RCC_HSE_OFF: turn off the HSE
  *   @arg RCC_HSE_ON: turn on the HSE
  *   @arg RCC_HSE_BYPASS: HSE bypassed with external clock
  * @retval None
  */
void RCC_HSEConfig(uint32_t RCC_HSE)
{
    /* Reset HSEEN and HSEBPS bits */
    RCC->GCCR &= GCCR_HSEEN_HSEBPS_RESET;
    /* Set the new state of HSE */
    RCC->GCCR |= RCC_HSE;

}

/**
  * @brief  Wait for HSE start-up.
  * @param  None
  * @retval The HSE start-up result(SUCCESS or ERROR)
  */
TypeState RCC_WaitForHSEStartUp(void)
{
    __IO uint32_t HSE_StartOk_Counter = 0;
    TypeState HSEState = RESET;
    
    /* Wait until HSE is ready and if timeout to exit */
    while((HSE_StartOk_Counter != HSE_STARTUP_TIMEOUT) && (HSEState == RESET))
    {
        HSEState = RCC_GetBitState(RCC_FLAG_HSESTB);
        HSE_StartOk_Counter++;  
    }
    
    if(RCC_GetBitState(RCC_FLAG_HSESTB) != RESET)
    {
        return SUCCESS;
    }
    else
    {
        return ERROR;
    }
}

/**
  * @brief  Adjust the Internal High Speed oscillator (HSI) calibration value.
  * @param  HSICalibrationValue: the HSI calibration value.
  *   This parameter must be between 0 and 0x1F.
  * @retval None
  */
void RCC_AdjustHSICalibrationValue(uint8_t HSICalibrationValue)
{
    uint32_t temp_adjust = 0;
    
    temp_adjust = RCC->GCCR;
    
    /* Clear HSIADJ[4:0] bits */
    temp_adjust &= ~RCC_GCCR_HSIADJ;
    
    /* Set HSIADJ[4:0] bits according to HSICalibrationValue value */
    temp_adjust |= (uint32_t)HSICalibrationValue << GCCR_HSIADJ_OFFSET ;
    
    /* Store the calibration value */
    RCC->GCCR = temp_adjust;
}

/**
  * @brief  Enable or disable the Internal High Speed oscillator (HSI).
  * @param  NewValue: new value of the HSI.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_HSI_Enable(TypeState NewValue)
{
  
    if (NewValue != DISABLE)
    {
        RCC->GCCR |= RCC_GCCR_HSIEN;
    }
    else
    {
        RCC->GCCR &= ~RCC_GCCR_HSIEN;
    }
}

/**
  * @brief  Configure the PLL clock source and multiplication factor.
  * @param  RCC_PLLSelect: specify the PLL clock source.
  *   For @b GD32_Connectivity_line_devices, this parameter can be one of the following values:
  *       @arg RCC_PLLSOURCE_HSI_DIV2: HSI divided by 2 selected as PLL clock source
  *       @arg RCC_PLLSOURCE_PREDIV1: PREDIV1 clock selected as PLL clock source
  * @param  RCC_PLLMF: specify the PLL multiplication factor.
  *   For @b GD32_Connectivity_line_devices, this parameter can be RCC_PLLMUL_x where x:{[2,32], 6_5}
  * @retval None
  */
void RCC_PLLConfig(uint32_t RCC_PLLSelect, uint32_t RCC_PLLMF)
{
    uint32_t temp = 0;

    temp = RCC->GCFGR;
    /* Clear PLLSEL [16] and PLLMF[4:0] bits */
    temp &= ~(RCC_GCFGR_PLLMF | RCC_GCFGR_PLLSEL);
    /* Set the PLLSEL and PLLMF */
    temp |= RCC_PLLSelect | RCC_PLLMF;

    RCC->GCFGR = temp;
}

/**
  * @brief  Enable or disable the PLL.
  * @param  NewValue: new value of the PLL.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_PLL_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->GCCR |= RCC_GCCR_PLLEN;
    }
    else
    {
        RCC->GCCR &= ~RCC_GCCR_PLLEN;
    }
}


/**
  * @brief  Configure the PREDV1 division factor.
  * @param  RCC_PREDV1_Source: specifies the PREDV1 clock source.
  *   This parameter can be one of the following values:
  *   @arg RCC_PREDIV1_SOURCE_HSE: HSE selected as PREDIV1 clock
  *   @arg RCC_PREDIV1_SOURCE_PLL2: PLL2 selected as PREDIV1 clock
  * @param  RCC_PREDV1_DIV: specify the PREDV1 division factor.
  *   This parameter can be RCC_PREDIV1_DIVx where x:[1,16]
  * @retval None
  */
void RCC_PREDV1Config(uint32_t RCC_PREDV1_Source, uint32_t RCC_PREDV1_Div)
{
    uint32_t temp = 0;
    
    temp = RCC->GCFGR2;
    /* Clear PREDV1[3:0] and PREDV1SEL bits */
    temp &= ~(RCC_GCFGR2_PREDV1 | RCC_GCFGR2_PREDV1SEL);
    /* Set the PREDV1 division factor and PREDV1SEL */
    temp |= (RCC_PREDV1_Div | RCC_PREDV1_Source);

    RCC->GCFGR2 = temp;
}

/**
  * @brief  Configure the PREDV2 division factor.
  * @param  RCC_PREDV2_Div: specify the PREDV2 clock division factor.
  *   This parameter can be RCC_PREDIV2_DIVx where x:[1,16]
  * @retval None
  */
void RCC_PREDV2Config(uint32_t RCC_PREDV2_Div)
{
    uint32_t temp = 0;
    
    temp = RCC->GCFGR2;
    /* Clear PREDV2[3:0] bits */
    temp &= ~RCC_GCFGR2_PREDV2;
    /* Set the PREDV2 division factor */
    temp |= RCC_PREDV2_Div;
    
    RCC->GCFGR2 = temp;
}

/**
  * @brief  Configure the PLL2 multiplication factor.
  * @param  RCC_PLL2MF: specify the PLL2 multiplication factor.
  *   This parameter can be RCC_PLL2MUL_x where x:{[8,14], 16, 20}
  * @retval None
  */
void RCC_PLL2Config(uint32_t RCC_PLL2MF)
{
    uint32_t temp = 0;
    
    temp = RCC->GCFGR2;
    /* Clear PLL2MF[3:0] bits */
    temp &= ~RCC_GCFGR2_PLL2MF;
    /* Set the PLL2 configuration bits */
    temp |= RCC_PLL2MF;

    RCC->GCFGR2 = temp;
}


/**
  * @brief  Enable or disable the PLL2.
  * @param  NewValue: new value of the PLL2.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_PLL2_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->GCCR |= RCC_GCCR_PLL2EN;
    }
    else
    {
        RCC->GCCR &= ~RCC_GCCR_PLL2EN;
    }
}


/**
  * @brief  Configure the PLL3 multiplication factor.
  * @param  RCC_PLL3MF: specify the PLL3 multiplication factor.
  *   This parameter can be RCC_PLL3MUL_x where x:{[8,14], 16, 20}
  * @retval None
  */
void RCC_PLL3Config(uint32_t RCC_PLL3MF)
{
    uint32_t temp = 0;
    
    temp = RCC->GCFGR2;
    /* Clear PLL2MF[3:0] bits */
    temp &= ~RCC_GCFGR2_PLL3MF;
    /* Set the PLL3 configuration bits */
    temp |= RCC_PLL3MF;

    RCC->GCFGR2 = temp;
}


/**
  * @brief  Enable or disable the PLL3.
  * @param  NewValue: new value of the PLL3.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_PLL3_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->GCCR |= RCC_GCCR_PLL3EN;
    }
    else
    {
        RCC->GCCR &= ~RCC_GCCR_PLL3EN;
    }
}

/**
  * @brief  Configure the system clock (CK_SYS) 
  * @param  RCC_SYSCLKSource: specify the system clock source 
  *   This parameter can be one of the following values:
  *   @arg RCC_SYSCLKSOURCE_HSI:    selecte HSI as CK_SYS source
  *   @arg RCC_SYSCLKSOURCE_HSE:    selecte HSE as CK_SYS source
  *   @arg RCC_SYSCLKSOURCE_PLLCLK: selecte PLL as CK_SYS source
  * @retval None
  */
void RCC_CK_SYSConfig(uint32_t RCC_SYSCLKSource)
{
    uint32_t temp = 0;
    
    temp = RCC->GCFGR;
    
    /* Clear SCS[1:0] bits */
    temp &= ~RCC_GCFGR_SCS;
    
    /* Set SCS[1:0] bits according to RCC_SYSCLKSource value */
    temp |= RCC_SYSCLKSource;
    
