LiteOS/LiteOS/GD32F207_Library/FWLib/src/gd32f20x_rcc.c
    /* Configure LSE */
    RCC->BDCR |= RCC_LSE;
}

/**
  * @brief  Configure LSE oscillator drive capability (LSEDRV).
  * @param  RCC_LSEDRV: specify LSE oscillator drive capability.
  *  This parameter can be one of the following values:
  *  @arg RCC_LSEDRV_LOW: specify LSE oscillator lower drive capability  
  *  @arg RCC_LSEDRV_MEDIUM_LOW: specify LSE oscillator medium low drive capability 
  *  @arg RCC_LSEDRV_MEDIUM_HIGH: specify LSE oscillator medium high drive capability
  *  @arg RCC_LSEDRV_HIGH: specify LSE oscillator higher drive capability
  * @retval None
  */
void RCC_LSEDRVConfig(uint32_t RCC_LSEDRV)
{

    /* Reset LSEDRV bits before configuring the LSEDVR */
    RCC->BDCR &= ~(RCC_BDCR_LSEDRV);
    
    /* Configure LSEDVE */
    RCC->BDCR |= RCC_LSEDRV;

}

/**
  * @brief  Enable or disable the Internal Low Speed oscillator (LSI).
  * @param  NewValue: new value of the LSI.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_LSI_Enable(TypeState NewValue)
{
    
    if (NewValue != DISABLE)
    {
        RCC->GCSR |= RCC_GCSR_LSIEN;
    }
    else
    {
        RCC->GCSR &= ~RCC_GCSR_LSIEN;
    }
}

/**
  * @brief  Configure the RTC clock (RTCCLK).           
  * @param  RCC_RTCCLKSource: specify the RTC clock source.
  *   This parameter can be one of the following values:
  *   @arg RCC_RTCCLKSOURCE_LSE: selecte LSE as RTC clock
  *   @arg RCC_RTCCLKSOURCE_LSI: selecte LSI as RTC clock
  *   @arg RCC_RTCCLKSOURCE_HSE_DIV128: selecte HSE divided by 128 as RTC clock         
  * @note   if using HSE as RTC source, the maximum clock frequency for RTC is 2 MHz.                     
  * @retval None
  */
void RCC_RTCCLKConfig(uint32_t RCC_RTCCLKSource)
{
    /* Clear RTCSEL bit */
    RCC->BDCR &= ~RCC_BDCR_RTCSEL;
    /* Select the RTC clock source */
    RCC->BDCR |= RCC_RTCCLKSource;
}

/**
  * @brief  Enable or disable the RTC clock.
  * @param  NewValue: new state of the RTC clock.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_RTCCLK_Enable(TypeState NewValue)		
{
  
    if (NewValue != DISABLE)
    {
        RCC->BDCR |= RCC_BDCR_RTCEN;
    }
    else
    {
        RCC->BDCR &= ~RCC_BDCR_RTCEN;
    }
}

/**
  * @brief  Get the frequencies of the CK_SYS, AHB, APB1, APB2, ADC clocks.    
  * @retval None
  */
void RCC_GetClocksFreq(RCC_ClocksPara* RCC_Clocks)
{
    uint32_t temp = 0, pllmf = 0, pllmf4=0,pllselect = 0, presc = 0;

    uint32_t prediv1select = 0, prediv1factor = 0, prediv2factor = 0, pll2mf = 0;

    
    /* Get CK_SYS source */
    temp = RCC->GCFGR & RCC_GCFGR_SCSS;
  
    switch (temp)
    {
        case 0x00:  /* HSI used as CK_SYS */
        RCC_Clocks->CK_SYS_Frequency = HSI_VALUE;
        break;
        case 0x04:  /* HSE used as CK_SYS */
        RCC_Clocks->CK_SYS_Frequency = HSE_VALUE;
        break;
        case 0x08:  /* PLL used as CK_SYS */
        /* Get PLL clock source and multiplication factor */
        /* Get PLLMF[3:0] */
        pllmf = RCC->GCFGR & RCC_GCFGR_PLLMF_3_0;
        /* Get PLLMF[4] */
        pllmf4 = RCC->GCFGR & RCC_GCFGR_PLLMF_4;

        pllmf4 = (( pllmf4 >> 29)*15);

        pllmf = ( pllmf >> 18) + pllmf4;
        if (pllmf != 0x0D)
        {
            pllmf += 2;
        }
        else
        { /* PLL multiplication factor = PLL input clock * 6.5 */
            pllmf = 13 / 2; 
        }
                
        pllselect = RCC->GCFGR & RCC_GCFGR_PLLSEL;
        if (pllselect == 0x00)
        {
            /* HSI clock divided by 2 selected as PLL clock source */
            RCC_Clocks->CK_SYS_Frequency = (HSI_VALUE >>HSI_CLOCK_DIVIDED_2) * pllmf;
        }
        else
        {
            /* PREDIV1 selected as PLL clock entry */
            
            /* Get PREDIV1 clock source and division factor */
            prediv1select = RCC->GCFGR2 & RCC_GCFGR2_PREDV1SEL;
            prediv1factor = (RCC->GCFGR2 & RCC_GCFGR2_PREDV1) + 1;
            
            if (prediv1select == 0)
            {   /* HSE clock selected as PREDIV1 clock entry */
                RCC_Clocks->CK_SYS_Frequency = (HSE_VALUE / prediv1factor) * pllmf;          
            }
            else
            {   /* PLL2 clock selected as PREDIV1 clock entry */
                /* Get PREDIV2 division factor and PLL2 multiplication factor */
                prediv2factor = ((RCC->GCFGR2 & RCC_GCFGR2_PREDV2) >> 4) + 1;
                pll2mf = ((RCC->GCFGR2 & RCC_GCFGR2_PLL2MF) >> 8);
                if(pll2mf != 15)
                {
                    pll2mf += 2;
                }
                else
                {
                    pll2mf += 5;
                }
                RCC_Clocks->CK_SYS_Frequency = (((HSE_VALUE / prediv2factor) * pll2mf) / prediv1factor) * pllmf;                         
            }
        }

        break;
        default: /* HSI used as system clock */
        RCC_Clocks->CK_SYS_Frequency = HSI_VALUE;
        break;
    }

    /* Get AHB prescaler */
    temp = RCC->GCFGR & RCC_GCFGR_AHBPS;
    temp = temp >> 4;
    presc = AHBPrescTable[temp]; 
    /* Get AHB clock frequency */
    RCC_Clocks->AHB_Frequency = RCC_Clocks->CK_SYS_Frequency >> presc;
    
    /* Get APB1 prescaler */
    temp = RCC->GCFGR & RCC_GCFGR_APB1PS;
    temp = temp >> 8;
    presc = APBPrescTable[temp];
    /* Get APB1 clock frequency */
    RCC_Clocks->APB1_Frequency = RCC_Clocks->AHB_Frequency >> presc;
    
    /* Get APB2 prescaler */
    temp = RCC->GCFGR & RCC_GCFGR_APB2PS;
    temp = temp >> 11;
    presc = APBPrescTable[temp];
    /* Get APB2 clock frequency */
    RCC_Clocks->APB2_Frequency = RCC_Clocks->AHB_Frequency >> presc;
    
    /* Get ADCCLK clock frequency */
    temp = ((RCC->GCFGR & RCC_GCFGR_ADCPS_2) >>26);
    temp += ((RCC->GCFGR & (RCC_GCFGR_ADCPS_0 | RCC_GCFGR_ADCPS_1)) >>14);
    switch (temp)
    {
        case 0x00: /* ADC Clock is derived from APB2/2 */
            RCC_Clocks->ADCCLK_Frequency = (RCC_Clocks->APB2_Frequency /2);
            break;
        case 0x01: /* ADC Clock is derived from APB2/4 */
            RCC_Clocks->ADCCLK_Frequency = (RCC_Clocks->APB2_Frequency /4);
            break;
        case 0x02: /* ADC Clock is derived from APB2/6 */
            RCC_Clocks->ADCCLK_Frequency = (RCC_Clocks->APB2_Frequency /6);
            break;
        case 0x03: /* ADC Clock is derived from APB2/8 */
            RCC_Clocks->ADCCLK_Frequency = (RCC_Clocks->APB2_Frequency /8);
            break;
        case 0x04: /* ADC Clock is derived from APB2/2 */
            RCC_Clocks->ADCCLK_Frequency = (RCC_Clocks->APB2_Frequency /2);
            break;
        case 0x05: /* ADC Clock is derived from APB2/12 */
            RCC_Clocks->ADCCLK_Frequency = (RCC_Clocks->APB2_Frequency /12);
            break;
        case 0x06: /* ADC Clock is derived from APB2/8 */
            RCC_Clocks->ADCCLK_Frequency = (RCC_Clocks->APB2_Frequency /8);
            break;
        case 0x07: /* ADC Clock is derived from APB2/16 */
            RCC_Clocks->ADCCLK_Frequency = (RCC_Clocks->APB2_Frequency /16);
            break;
        default:
            break;
    }
}

/**
  * @brief  Enable or disable the AHB peripheral clock.    
  * @param  RCC_AHBPeriph: specify the AHB peripheral clock.
  *   For @b GD32_Connectivity_line_devices, 
  *   this parameter can be any combination of the following values:        
  *   @arg RCC_AHBPERIPH_DMA1
  *   @arg RCC_AHBPERIPH_DMA2
  *   @arg RCC_AHBPERIPH_SRAM
  *   @arg RCC_AHBPERIPH_FMC
  *   @arg RCC_AHBPERIPH_CRC
  *   @arg RCC_AHBPERIPH_EXMC
  *   @arg RCC_AHBPERIPH_SDIO
  *   @arg RCC_AHBPERIPH_OTG_FS    
  *   @arg RCC_AHBPERIPH_ETH_MAC   
  *   @arg RCC_AHBPERIPH_ETH_MAC_RX
  *   @arg RCC_AHBPERIPH_ETH_MAC_TX
  * 
  * @param  NewValue: new state of the peripheral clock.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_AHBPeriphClock_Enable(uint32_t RCC_AHBPeriph, TypeState NewValue)
{
  
