LiteOS/LiteOS/GD32F207_Library/FWLib/src/gd32f20x_rcc.c
    if (NewValue != DISABLE)
    {
        RCC->AHBCCR |= RCC_AHBPeriph;
    }
    else
    {
        RCC->AHBCCR &= ~RCC_AHBPeriph;
    }
}

/**
  * @brief  Enable or disable the APB2 peripheral clock.
  * @param  RCC_APB2Periph: specify the APB2 peripheral clock.
  *   This parameter can be any combination of the following values:
  *   @arg RCC_APB2PERIPH_AF
  *   @arg RCC_APB2PERIPH_GPIOA
  *   @arg RCC_APB2PERIPH_GPIOB
  *   @arg RCC_APB2PERIPH_GPIOC
  *   @arg RCC_APB2PERIPH_GPIOD
  *   @arg RCC_APB2PERIPH_GPIOE
  *   @arg RCC_APB2PERIPH_GPIOF
  *   @arg RCC_APB2PERIPH_GPIOG
  *   @arg RCC_APB2PERIPH_ADC1
  *   @arg RCC_APB2PERIPH_ADC2
  *   @arg RCC_APB2PERIPH_TIMER1
  *   @arg RCC_APB2PERIPH_SPI1
  *   @arg RCC_APB2PERIPH_TIMER8
  *   @arg RCC_APB2PERIPH_USART1
  *   @arg RCC_APB2PERIPH_ADC3
  *   @arg RCC_APB2PERIPH_TIMER9
  *   @arg RCC_APB2PERIPH_TIMER10
  *   @arg RCC_APB2PERIPH_TIMER11    
  * @param  NewValue: new state of the peripheral clock.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_APB2PeriphClock_Enable(uint32_t RCC_APB2Periph, TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->APB2CCR |= RCC_APB2Periph;
    }
    else
    {
        RCC->APB2CCR &= ~RCC_APB2Periph;
    }
}

/**
  * @brief  Enable or disable the APB1 peripheral clock.
  * @param  RCC_APB1Periph: specify the APB1 peripheral clock.
  *   This parameter can be any combination of the following values:
  *   @arg RCC_APB1PERIPH_TIMER2
  *   @arg RCC_APB1PERIPH_TIMER3
  *   @arg RCC_APB1PERIPH_TIMER4
  *   @arg RCC_APB1PERIPH_TIMER5
  *   @arg RCC_APB1PERIPH_TIMER6
  *   @arg RCC_APB1PERIPH_TIMER7
  *   @arg RCC_APB1PERIPH_TIMER12
  *   @arg RCC_APB1PERIPH_TIMER13
  *   @arg RCC_APB1PERIPH_TIMER14
  *   @arg RCC_APB1PERIPH_WWDG
  *   @arg RCC_APB1PERIPH_SPI2
  *   @arg RCC_APB1PERIPH_SPI3,
  *   @arg RCC_APB1PERIPH_USART2
  *   @arg RCC_APB1PERIPH_USART3
  *   @arg RCC_APB1PERIPH_UART4 
  *   @arg RCC_APB1PERIPH_UART5
  *   @arg RCC_APB1PERIPH_I2C1
  *   @arg RCC_APB1PERIPH_I2C2
  *   @arg RCC_APB1PERIPH_CAN1
  *   @arg RCC_APB1PERIPH_CAN2
  *   @arg RCC_APB1PERIPH_BKP
  *   @arg RCC_APB1PERIPH_PWR
  *   @arg RCC_APB1PERIPH_DAC
  * @param  NewState: new state of the specified peripheral clock.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_APB1PeriphClock_Enable(uint32_t RCC_APB1Periph, TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->APB1CCR |= RCC_APB1Periph;
    }
    else
    {
        RCC->APB1CCR &= ~RCC_APB1Periph;
    }
}

/**
  * @brief  Force or release AHB peripheral reset.
  * @param  RCC_AHBPeriphRST: specify the AHB peripheral to reset.
  *   This parameter can be any combination of the following values:
  *   @arg RCC_AHBPERIPH_OTGFSRST 
  *   @arg RCC_AHBPERIPH_ETHMACRST
  * @param  NewState: new state of the specified peripheral reset.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_AHBPeriphReset_Enable(uint32_t RCC_AHBPeriphRST, TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->AHBRCR |= RCC_AHBPeriphRST;
    }
    else
    {
        RCC->AHBRCR &= ~RCC_AHBPeriphRST;
    }
}

/**
  * @brief  Force or release APB2 peripheral reset.
  * @param  RCC_APB2PeriphRST: specify the APB2 peripheral to reset.
  *   This parameter can be any combination of the following values:
  *   @arg RCC_APB2PERIPH_AFRST
  *   @arg RCC_APB2PERIPH_GPIOARST
  *   @arg RCC_APB2PERIPH_GPIOBRST
  *   @arg RCC_APB2PERIPH_GPIOCRST
  *   @arg RCC_APB2PERIPH_GPIODRST
  *   @arg RCC_APB2PERIPH_GPIOERST
  *   @arg RCC_APB2PERIPH_GPIOFRST
  *   @arg RCC_APB2PERIPH_GPIOGRST
  *   @arg RCC_APB2PERIPH_ADC1RST
  *   @arg RCC_APB2PERIPH_ADC2RST
  *   @arg RCC_APB2PERIPH_TIMER1RST
  *   @arg RCC_APB2PERIPH_SPI1RST
  *   @arg RCC_APB2PERIPH_TIMER8RST
  *   @arg RCC_APB2PERIPH_USART1RST
  *   @arg RCC_APB2PERIPH_ADC3RST
  *   @arg RCC_APB2PERIPH_TIMER9RST
  *   @arg RCC_APB2PERIPH_TIMER10RST
  *   @arg RCC_APB2PERIPH_TIMER11RST  
  * @param  NewValue: new state of the peripheral reset.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_APB2PeriphReset_Enable(uint32_t RCC_APB2PeriphRST, TypeState NewValue)
{

    if (NewValue != DISABLE)
    {
        RCC->APB2RCR |= RCC_APB2PeriphRST;
    }
    else
    {
        RCC->APB2RCR &= ~RCC_APB2PeriphRST;
    }
}


/**
  * @brief  Force or release APB1 peripheral reset.
  * @param  RCC_APB1PeriphRST: specify the APB1 peripheral to reset.
  *   This parameter can be any combination of the following values:
  *   @arg RCC_APB1PERIPH_TIMER2RST
  *   @arg RCC_APB1PERIPH_TIMER3RST
  *   @arg RCC_APB1PERIPH_TIMER4RST
  *   @arg RCC_APB1PERIPH_TIMER5RST
  *   @arg RCC_APB1PERIPH_TIMER6RST
  *   @arg RCC_APB1PERIPH_TIMER7RST
  *   @arg RCC_APB1PERIPH_TIMER12RST
  *   @arg RCC_APB1PERIPH_TIMER13RST
  *   @arg RCC_APB1PERIPH_TIMER14RST
  *   @arg RCC_APB1PERIPH_WWDGRST
  *   @arg RCC_APB1PERIPH_SPI2RST
  *   @arg RCC_APB1PERIPH_SPI3RST
  *   @arg RCC_APB1PERIPH_USART2RST
  *   @arg RCC_APB1PERIPH_USART3RST
  *   @arg RCC_APB1PERIPH_UART4RST 
  *   @arg RCC_APB1PERIPH_UART5RST
  *   @arg RCC_APB1PERIPH_I2C1RST
  *   @arg RCC_APB1PERIPH_I2C2RST
  *   @arg RCC_APB1PERIPH_CAN1RST
  *   @arg RCC_APB1PERIPH_CAN2RST
  *   @arg RCC_APB1PERIPH_BKPRST
  *   @arg RCC_APB1PERIPH_PWRRST
  *   @arg RCC_APB1PERIPH_DACRST
  * @param  NewValue: new state of the peripheral clock (ENABLE or DISABLE).
  * @retval None
  */
void RCC_APB1PeriphReset_Enable(uint32_t RCC_APB1PeriphRST, TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->APB1RCR |= RCC_APB1PeriphRST;
    }
    else
    {
        RCC->APB1RCR &= ~RCC_APB1PeriphRST;
    }
}

/**
  * @brief  Enable or disable the AHB2 peripheral clock.    
  * @param  RCC_AHB2Periph: specify the AHB2 peripheral clock.
  *   this parameter can be any combination of the following values:        
  *   @arg RCC_AHB2PERIPH_DCI
  *   @arg RCC_AHB2PERIPH_CAU
  *   @arg RCC_AHB2PERIPH_HAU
  *   @arg RCC_AHB2PERIPH_RNG
  * @param  NewValue: new state of the peripheral clock.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_AHB2PeriphClock_Enable(uint32_t RCC_AHB2Periph, TypeState NewValue)
{
  
