LiteOS/LiteOS/GD32F207_Library/FWLib/src/gd32f20x_rcc.c
    if (NewValue != DISABLE)
    {
        RCC->AHB2CCR |= RCC_AHB2Periph;
    }
    else
    {
        RCC->AHB2CCR &= ~RCC_AHB2Periph;
    }
}

/**
  * @brief  Enable or disable the APB2 peripheral 2 clock.
  * @param  RCC_APB2Periph2: specify the APB2 peripheral 2 clock.
  *   This parameter can be any combination of the following values:
  *   @arg RCC_APB2PERIPH2_USART6
  *   @arg RCC_APB2PERIPH2_TLDI
  *   @arg RCC_APB2PERIPH2_GPIOH
  *   @arg RCC_APB2PERIPH2_GPIOI
  * @param  NewValue: new state of the peripheral 2 clock.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_APB2Periph2Clock_Enable(uint32_t RCC_APB2Periph2, TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->APB2CCR2 |= RCC_APB2Periph2;
    }
    else
    {
        RCC->APB2CCR2 &= ~RCC_APB2Periph2;
    }
}

/**
  * @brief  Enable or disable the APB1 peripheral 2 clock.
  * @param  RCC_APB1Periph2: specify the APB1 peripheral 2 clock.
  *   This parameter can be any combination of the following values:
  *   @arg RCC_APB1PERIPH2_I2C3
  *   @arg RCC_APB1PERIPH2_UART7
  *   @arg RCC_APB1PERIPH2_UART8
  * @param  NewState: new state of the specified peripheral 2 clock.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_APB1Periph2Clock_Enable(uint32_t RCC_APB1Periph2, TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->APB1CCR2 |= RCC_APB1Periph2;
    }
    else
    {
        RCC->APB1CCR2 &= ~RCC_APB1Periph2;
    }
}

/**
  * @brief  Force or release AHB2 peripheral reset.
  * @param  RCC_AHB2PeriphRST: specify the AHB2 peripheral to reset.
  *   This parameter can be any combination of the following values:
  *   @arg RCC_AHB2PERIPH_DCIRST 
  *   @arg RCC_AHB2PERIPH_CAURST
  *   @arg RCC_AHB2PERIPH_HAURST
  *   @arg RCC_AHB2PERIPH_RNGRST
  * @param  NewState: new state of the specified peripheral reset.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_AHB2PeriphReset_Enable(uint32_t RCC_AHB2PeriphRST, TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->AHB2RCR |= RCC_AHB2PeriphRST;
    }
    else
    {
        RCC->AHB2RCR &= ~RCC_AHB2PeriphRST;
    }
}

/**
  * @brief  Force or release APB2 peripheral 2 reset.
  * @param  RCC_APB2Periph2RST: specify the APB2 peripheral2 to reset.
  *   This parameter can be any combination of the following values:
  *   @arg RCC_APB2PERIPH2_USART6RST
  *   @arg RCC_APB2PERIPH2_TLDIRST
  *   @arg RCC_APB2PERIPH2_GPIOHRST
  *   @arg RCC_APB2PERIPH2_GPIOIRST
  * @param  NewValue: new state of the peripheral reset.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_APB2Periph2Reset_Enable(uint32_t RCC_APB2Periph2RST, TypeState NewValue)
{

    if (NewValue != DISABLE)
    {
        RCC->APB2RCR2 |= RCC_APB2Periph2RST;
    }
    else
    {
        RCC->APB2RCR2 &= ~RCC_APB2Periph2RST;
    }
}


/**
  * @brief  Force or release APB1 peripheral 2 reset.
  * @param  RCC_APB1Periph2RST: specify the APB1 peripheral 2 to reset.
  *   This parameter can be any combination of the following values:
  *   @arg RCC_APB1PERIPH2_I2C3RST
  *   @arg RCC_APB1PERIPH2_UART7RST
  *   @arg RCC_APB1PERIPH2_UART8RST
  * @param  NewValue: new state of the peripheral clock (ENABLE or DISABLE).
  * @retval None
  */
void RCC_APB1Periph2Reset_Enable(uint32_t RCC_APB1Periph2RST, TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->APB1RCR2 |= RCC_APB1Periph2RST;
    }
    else
    {
        RCC->APB1RCR2 &= ~RCC_APB1Periph2RST;
    }
}

/**
  * @brief  Force or release the Backup domain reset.
  * @param  NewValue: new state of the Backup domain reset (ENABLE or DISABLE).
  * @retval None
  */
void RCC_BackupReset_Enable(TypeState NewValue)
{
  
    if (NewValue != DISABLE)
    {
        RCC->BDCR |= RCC_BDCR_BKPRST;
    }
    else
    {
        RCC->BDCR &= ~RCC_BDCR_BKPRST;
    }
}

/**
  * @brief  Enable or disable the Clock Security System.
  * @param  NewValue: new value of the Clock Security System.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_HSEClockMonitor_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->GCCR |= RCC_GCCR_CKMEN;
    }
    else
    {
        RCC->GCCR &= ~RCC_GCCR_CKMEN;
    }
}


/**
  * @brief  Select the clock source to output on CKOUTSRC and the corresponding prescaler.
  * @param  RCC_CKOUTSRC: specify the clock source to output.
  *   For @b GD32_Connectivity_line_devices, this parameter can be one of the
  *   following values:       
  *   @arg RCC_CKOUTSRC_NOCLOCK: No clock selected
  *   @arg RCC_CKOUTSRC_SYSCLK: System clock selected
  *   @arg RCC_CKOUTSRC_HSI: HSI oscillator clock selected
  *   @arg RCC_CKOUTSRC_HSE: HSE oscillator clock selected
  *   @arg RCC_CKOUTSRC_PLL2CLK: PLL2 clock selected                     
  *   @arg RCC_CKOUTSRC_PLLCLK_DIV2: PLL clock divided by 2 selected
  *   @arg RCC_CKOUTSRC_PLL3CLK: PLL3 clock selected 
  *   @arg RCC_CKOUTSRC_PLL3CLK_DIV2: PLL3 clock divided by 2 selected   
  *   @arg RCC_CKOUTSRC_EXT1: External 3-25 MHz oscillator clock selected  
  * @param  RCC_CKOUTDIVx: configure the prescaler of the CKOUT,x:[1,64].
  * @retval None
  */

void RCC_CKOUTSELConfig(uint32_t RCC_CKOUTSRC, uint32_t RCC_CKOUTDIVx)
{
    uint32_t temp_source = 0;
    uint32_t temp_divide = 0;
 
    temp_source = RCC->GCFGR;
    /* Clear CKOUTSRC[2:0] bits */
    temp_source &= ~(RCC_GCFGR_CKOUTSEL);
    /* Set the RCC_CKOUTSRC */
    temp_source |= RCC_CKOUTSRC;
    /* Store the new value */
    RCC->GCFGR = temp_source;

    temp_divide = RCC->GCFGR3;
    /* Clear CKOUTDIV[5:0] bits */
    temp_divide &= ~(RCC_GCFGR3_CKOUTDIV);
    /* Set the RCC_CKOUTDIV */
    temp_divide |= RCC_CKOUTDIVx;
    /* Store the new value */
    RCC->GCFGR3 = temp_divide;
}

/**
  * @brief  Select the clock source to output on CKOUT2SRC and the corresponding prescaler.
  * @param  RCC_CKOUT2SRC: specify the clock source to output.
  *   For @b GD32_Connectivity_line_devices, this parameter can be one of the
  *   following values:       
  *   @arg RCC_CKOUT2SRC_NOCLOCK: No clock selected
  *   @arg RCC_CKOUT2SRC_SYSCLK: System clock selected
  *   @arg RCC_CKOUT2SRC_HSI: HSI oscillator clock selected
  *   @arg RCC_CKOUT2SRC_HSE: HSE oscillator clock selected
  *   @arg RCC_CKOUT2SRC_PLL2CLK: PLL2 clock selected                     
  *   @arg RCC_CKOUT2SRC_PLLCLK_DIV2: PLL clock divided by 2 selected
  *   @arg RCC_CKOUT2SRC_PLL3CLK: PLL3 clock selected 
  *   @arg RCC_CKOUT2SRC_PLL3CLK_DIV2: PLL3 clock divided by 2 selected   
  *   @arg RCC_CKOUT2SRC_EXT1: External 3-25 MHz oscillator clock selected  
  * @param  RCC_CKOUT2DIVx: configure the prescaler of the CKOUT2,x:[1,64].
  * @retval None
  */

void RCC_CKOUT2SELConfig(uint32_t RCC_CKOUT2SRC, uint32_t RCC_CKOUT2DIVx)
{
    uint32_t temp_source = 0;
 
