LiteOS/LiteOS/GD32F207_Library/FWLib/src/gd32f20x_rcc.c
    temp_source = RCC->GCFGR3;
    /* Clear CKOUTSRC[2:0] bits */
    temp_source &= ~(RCC_GCFGR3_CKOUT2SEL | RCC_GCFGR3_CKOUT2DIV);
    /* Set the RCC_CKOUTSRC */
    temp_source |= (RCC_CKOUT2SRC | RCC_CKOUT2DIVx);
    /* Store the new value */
    RCC->GCFGR3 = temp_source;

}
/**
  * @brief  Enable or disable RCC interrupts.
  * @param  RCC_INT: specify the RCC interrupt sources.
  *   For @b GD32_Connectivity_line_devices, this parameter can be any combination
  *   of the following values        
  *   @arg RCC_INT_LSISTB: LSI ready interrupt
  *   @arg RCC_INT_LSESTB LSE ready interrupt
  *   @arg RCC_INT_HSISTB: HSI ready interrupt
  *   @arg RCC_INT_HSESTB: HSE ready interrupt
  *   @arg RCC_INT_PLLSTB: PLL ready interrupt
  *   @arg RCC_INT_PLL2STB: PLL2 ready interrupt
  *   @arg RCC_INT_PLL3STB: PLL3 ready interrupt
  *   @arg RCC_INT_PLLTSTB:  PLLT ready interrupt
  * @param  NewValue: new state of the RCC interrupts (ENABLE or DISABLE).
  * @retval None
  */
void RCC_INTConfig(uint32_t RCC_INT, TypeState NewValue)
{  
    uint32_t temp = 0;                    

    /* Get the RCC register index */
    temp = RCC_INT >> 8;
    if(temp == 0)
    {
        if (NewValue != DISABLE)
        {
            /* Perform Byte access to RCC_GCIR[14:8] bits to enable the selected interrupts */
            RCC->GCIR |= (RCC_INT<<8);
        }
        else
        {
            /* Perform Byte access to RCC_GCIR bits to disable the selected interrupts */
             RCC->GCIR &= ~(RCC_INT<<8);
        }
    }
    else
    {
        if (NewValue != DISABLE)
        {
            /* Perform Byte access to RCC_GPLLTIR 14 bit to enable the selected interrupts */
            RCC->GPLLTIR |= (RCC_INT<<8);
        }
        else
        {
            /* Perform Byte access to RCC_GPLLTIR 14 bit to disable the selected interrupts */
            RCC->GPLLTIR &= ~(RCC_INT<<8);
        }
    }

}


/**
  * @brief  Check whether the specified RCC flag is set or not.
  * @param  RCC_FLAG: specify the flag to check.
  *   For @b GD32_Connectivity_line_devices, this parameter can be one of the
  *   following values:
  *   @arg RCC_FLAG_HSISTB: HSI clock ready
  *   @arg RCC_FLAG_HSESTB: HSE clock ready
  *   @arg RCC_FLAG_PLLSTB: PLL clock ready
  *   @arg RCC_FLAG_PLL2STB: PLL2 clock ready      
  *   @arg RCC_FLAG_PLL3STB: PLL3 clock ready                           
  *   @arg RCC_FLAG_LSESTB: LSE clock ready
  *   @arg RCC_FLAG_LSISTB: LSI clock ready
  *   @arg RCC_FLAG_PLLTSTB: PLLT clock ready,(only for GD32F20X devices)
  *   @arg RCC_FLAG_EPRST: Pin reset
  *   @arg RCC_FLAG_POPDRST: POR/PDR reset
  *   @arg RCC_FLAG_SWRRST: Software reset
  *   @arg RCC_FLAG_IWDGRST: Independent Watchdog reset
  *   @arg RCC_FLAG_WWDGRST: Window Watchdog reset
  *   @arg RCC_FLAG_LPRRST: Low Power reset
  * @retval The new state of RCC_FLAG (SET or RESET).
  */
TypeState RCC_GetBitState(uint8_t RCC_FLAG)
{
    uint32_t temp = 0;                    
    uint32_t statusreg = 0;

    /* Get the RCC register index */
    temp = RCC_FLAG >> 5;
    
    /* The flag to check is in GCCR register */
    if (temp == 1)              
    {
        statusreg = RCC->GCCR;
    }
    
    /* The flag to check is in BDCR register */
    else if (temp == 2)          
    {
        statusreg = RCC->BDCR;
    }
    /* The flag to check is in GPLLTCR register */
    else if (temp == 4)          
    {
        statusreg = RCC->GPLLTCR;
    }
    
    /* The flag to check is in GCSR register */
    else                       
    {
        statusreg = RCC->GCSR;
    }

    /* Get the flag position */
    temp = RCC_FLAG & FLAG_MASK;
    if ((statusreg & ((uint32_t)(1 << temp))) != (uint32_t)RESET)
    {
        return SET;
    }
    else
    {
        return RESET;
    }

}

/**
  * @brief  Clear the RCC all reset flags.
  * @param  None
  * @retval None
  */
void RCC_ClearBitState(void)
{
    /* Set RSTFC bit to clear all reset flags */
    RCC->GCSR |= RCC_GCSR_RSTFC;
}


/**
  * @brief  Check whether the RCC interrupt has occurred or not.
  * @param  RCC_INT: specify the RCC interrupt source to check.
  *   For @b GD32_Connectivity_line_devices, this parameter can be one of the
  *   following values:
  *   @arg RCC_INT_LSISTB: the flag of LSI ready interrupt
  *   @arg RCC_INT_LSESTB: the flag of LSE ready interrupt
  *   @arg RCC_INT_HSISTB: the flag of HSI ready interrupt
  *   @arg RCC_INT_HSESTB: the flag of HSE ready interrupt
  *   @arg RCC_INT_PLLSTB: the flag of PLL ready interrupt
  *   @arg RCC_INT_PLL2STB: the flag of PLL2 ready interrupt
  *   @arg RCC_INT_PLL3STB: the flag of PLL3 ready interrupt
  *   @arg RCC_INT_CKM: the flag of Clock Security System interrupt
  *   @arg RCC_INT_PLLTSTB: the flag PLLT ready interrupt,(only for GD32F20X devices)
  * @retval The new state of RCC_INT (SET or RESET).
  */
TypeState RCC_GetIntBitState(uint32_t RCC_INT)
{  
    uint32_t temp = 0;                    

    /* Get the RCC register index */
    temp = RCC_INT >> 8;
    if(temp == 0)
    {
      /* Check the status of the RCC interrupt */
        if ((RCC->GCIR & RCC_INT) != (uint32_t)RESET)
        {
            return SET;
        }
        else
        {
            return RESET;
        }
    }
    else
    {
      /* Check the status of the RCC interrupt */
        if ((RCC->GPLLTIR & (RCC_INT & ((uint32_t)0x00000040))) != (uint32_t)RESET)
        {
            return SET;
        }
        else
        {
            return RESET;
        }
    }

}
/**
  * @brief  Clear the RCC interrupt bits.
  * @param  RCC_INT: specify the interrupt bit to clear.
  *   For @b GD32_Connectivity_line_devices, this parameter can be any combination
  *   of the following values:
  *   @arg RCC_INT_LSISTB: LSI ready interrupt
  *   @arg RCC_INT_LSESTB LSE ready interrupt
  *   @arg RCC_INT_HSISTB: HSI ready interrupt
  *   @arg RCC_INT_HSESTB: HSE ready interrupt
  *   @arg RCC_INT_PLLSTB: PLL ready interrupt
  *   @arg RCC_INT_PLL2STB: PLL2 ready interrupt
  *   @arg RCC_INT_PLL3STB: PLL3 ready interrupt
  *   @arg RCC_INT_CKM: Clock Security System interrupt
  *   @arg RCC_INT_PLLTSTB: PLLT ready interrupt, (only for GD32F20X devices)
  * @retval None
  */

