LiteOS/LiteOS/GD32F207_Library/FWLib/src/gd32f20x_rcc.c
void RCC_ClearIntBitState(uint32_t RCC_INT)
{
    uint32_t temp = 0;                    

    /* Get the RCC register index */
    temp = RCC_INT >> 8;
    if(temp == 0)
    {
        /* Perform RCC_GCIR[23:16] bits to clear the selected interrupt bits */
        RCC->GCIR |= (RCC_INT<<16);
    }
    else
    {
        /* Perform RCC_GPLLTIR[23:16] bits to clear the selected interrupt bits */
         RCC->GPLLTIR |= (RCC_INT<<16);
    }
}

/**
  * @brief  Configure the kernel voltage in Deep-sleep mode.
  * @note   Only unlock the power,this configuration is effective.
  * @param  RCC_KERNEL_VOL: specify the kernel voltage. 
  *   This parameter can be one of the following values:
  *   @arg RCC_KERNEL_VOL1_2: The kernel voltage in Deep-sleep mode is 1.2V 
  *   @arg RCC_KERNEL_VOL1_1: The kernel voltage in Deep-sleep mode is 1.1V 
  *   @arg RCC_KERNEL_VOL1_0: The kernel voltage in Deep-sleep mode is 1.0V
  *   @arg RCC_KERNEL_VOL0_9: The kernel voltage in Deep-sleep mode is 0.9V
  * @retval None
  */
void RCC_KERNELVOLConfig(uint32_t RCC_KERNEL_VOL) 
{ 
    /* Clear DEEPSLEEP_VC bit */
    RCC->RCC_DEEPSLEEP_VC &= ~RCC_DEEPSLEEP_VC_CLEAR;
    /* Set DEEPSLEEP_VC bits according to RCC_KERNEL_VOL value */
    RCC->RCC_DEEPSLEEP_VC |= RCC_KERNEL_VOL;
}

/**
  * @brief  Enable or disable the PLLT clock.    
  * @param  NewValue: new state of the peripheral clock.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_PLLT_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->GPLLTCR |= RCC_GPLLTCR_PLLTEN;
    }
    else
    {
        RCC->GPLLTCR &= ~RCC_GPLLTCR_PLLTEN;
    }
}

/**
  * @brief  Configure the PLLT clock (PLLTCLK).
  * @note   The PLLT clock can be changed when PLLT is disabled.
  * @param  RCC_PLLTCLKSource: specify the PLLT clock source.
  *   This parameter can be one of the following values:
  *     @arg RCC_PLLTCLKSOURCE_HSE: HSE selected as PLLT clock
  *     @arg RCC_PLLTCLKSOURCE_HSI: HSI selected as PLLT clock
  * @retval None
  */
void RCC_PLLTCLKConfig(uint32_t RCC_PLLTCLKSource)
{

    /* Clear PLLSAISRC */
    RCC->PLLTCFGR &= ~RCC_PLLTCFGR_PLLTSEL;
    /* Select the PLLSAL clock source */
    RCC->PLLTCFGR |= RCC_PLLTCLKSource;

}

/**
  * @brief  Configure the PLLT clock multiplication and division factors.
  *
  * @note   This function can be used only for GD32F20X devices 
  *        
  * @note   This function must be used only when the PLLT is disabled.
  *             
  * @param  PLLTPS: specify the division factor for PLLT VCO input clock
  *          This parameter must be a number between 2 and 63.
  *            PLLT VCO input clock = PLLT clock/PLLTPS.       
  *
  * @note   You have to set the PLLTPS parameter correctly to ensure that the VCO input
  *         frequency ranges from 1 to 2 MHz. 
  *   
  * @param  PLLTMF: specify the multiplication factor for PLLT VCO output clock
  *          This parameter must be a number between 49 and 432.
  *            PLLT VCO output clock = PLLT VCO input clock * PLLTMF.       
  *   
  * @param  PLLTRPS: specify the division factor for TLDI clock
  *          This parameter must be a number between 2 and 7.
  *            f(PLLT_R) = PLLT VCO output clock/PLLTRPS.       
  *   
  * @retval None
  */
void RCC_PLLTVCOConfig(uint32_t PLLTPS, uint32_t PLLTMF, uint32_t PLLTRPS)
{
    /* Clear PLLTPS, PLLMF, PLLTRPS bits */
    RCC->PLLTCFGR &= ~( RCC_PLLTCFGR_PLLTPS | RCC_PLLTCFGR_PLLTMF | RCC_PLLTCFGR_PLLTRPS);
    /* Select the PLLSAL clock source */    
    RCC->PLLTCFGR |= (PLLTPS | (PLLTMF << 6) | (PLLTRPS << 28));
}

/**
  * @brief  Configure the TLDI clock Divider coming from PLLT.
  * 
  * @note   The LTDC peripheral is only available with GD32F20X Devices.
  *      
  * @note   This function must be called before enabling the PLLT.
  *   
  * @param  RCC_PLLT_TLDIPS_Divx: specify the PLLT_R division factor for TLDI clock .
  *   This parameter can be one of the following values:
  *     @arg RCC_PLLT_TLDIPS_DIV2: TLDI clock = PLLT_R/2
  *     @arg RCC_PLLT_TLDIPS_DIV4: TLDI clock = PLLT_R/4
  *     @arg RCC_PLLT_TLDIPS_DIV8: TLDI clock = PLLT_R/8
  *     @arg RCC_PLLT_TLDIPS_DIV16: TLDI clock = PLLT_R/16
  *          TLDI clock frequency = f(PLLT_R) / RCC_PLLT_TLDIPS_Divx  
  *            
  * @retval None
  */
void RCC_TLDICLKDivConfig(uint32_t RCC_PLLT_TLDIPS_Divx)
{
    uint32_t temp = 0;
    
    temp = RCC->PLLTCFGR;
    
    /* Clear TCDIPS[1:0] bits */
    temp &= ~RCC_PLLTCFGR_TLDIPS;
    
    /* Set TCDIPS[1:0] values */
    temp |= RCC_PLLT_TLDIPS_Divx;
    
    /* Store the new value */
    RCC->PLLTCFGR = temp;
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/******************* (C) COPYRIGHT 2015 GIGADEVICE *****END OF FILE****/


